GopalSaraf/Practicals/PSDL/include/proc/pic18f56k42.h
extern volatile RF2PPSbits_t RF2PPSbits __at(0x3A2A);
// bitfield macros
#define _RF2PPS_RF2PPS0_POSN                                0x0
#define _RF2PPS_RF2PPS0_POSITION                            0x0
#define _RF2PPS_RF2PPS0_SIZE                                0x1
#define _RF2PPS_RF2PPS0_LENGTH                              0x1
#define _RF2PPS_RF2PPS0_MASK                                0x1
#define _RF2PPS_RF2PPS1_POSN                                0x1
#define _RF2PPS_RF2PPS1_POSITION                            0x1
#define _RF2PPS_RF2PPS1_SIZE                                0x1
#define _RF2PPS_RF2PPS1_LENGTH                              0x1
#define _RF2PPS_RF2PPS1_MASK                                0x2
#define _RF2PPS_RF2PPS2_POSN                                0x2
#define _RF2PPS_RF2PPS2_POSITION                            0x2
#define _RF2PPS_RF2PPS2_SIZE                                0x1
#define _RF2PPS_RF2PPS2_LENGTH                              0x1
#define _RF2PPS_RF2PPS2_MASK                                0x4
#define _RF2PPS_RF2PPS3_POSN                                0x3
#define _RF2PPS_RF2PPS3_POSITION                            0x3
#define _RF2PPS_RF2PPS3_SIZE                                0x1
#define _RF2PPS_RF2PPS3_LENGTH                              0x1
#define _RF2PPS_RF2PPS3_MASK                                0x8
#define _RF2PPS_RF2PPS4_POSN                                0x4
#define _RF2PPS_RF2PPS4_POSITION                            0x4
#define _RF2PPS_RF2PPS4_SIZE                                0x1
#define _RF2PPS_RF2PPS4_LENGTH                              0x1
#define _RF2PPS_RF2PPS4_MASK                                0x10
#define _RF2PPS_RF2PPS5_POSN                                0x5
#define _RF2PPS_RF2PPS5_POSITION                            0x5
#define _RF2PPS_RF2PPS5_SIZE                                0x1
#define _RF2PPS_RF2PPS5_LENGTH                              0x1
#define _RF2PPS_RF2PPS5_MASK                                0x20

// Register: RF3PPS
#define RF3PPS RF3PPS
extern volatile unsigned char           RF3PPS              __at(0x3A2B);
#ifndef _LIB_BUILD
asm("RF3PPS equ 03A2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF3PPS0                :1;
        unsigned RF3PPS1                :1;
        unsigned RF3PPS2                :1;
        unsigned RF3PPS3                :1;
        unsigned RF3PPS4                :1;
        unsigned RF3PPS5                :1;
    };
} RF3PPSbits_t;
extern volatile RF3PPSbits_t RF3PPSbits __at(0x3A2B);
// bitfield macros
#define _RF3PPS_RF3PPS0_POSN                                0x0
#define _RF3PPS_RF3PPS0_POSITION                            0x0
#define _RF3PPS_RF3PPS0_SIZE                                0x1
#define _RF3PPS_RF3PPS0_LENGTH                              0x1
#define _RF3PPS_RF3PPS0_MASK                                0x1
#define _RF3PPS_RF3PPS1_POSN                                0x1
#define _RF3PPS_RF3PPS1_POSITION                            0x1
#define _RF3PPS_RF3PPS1_SIZE                                0x1
#define _RF3PPS_RF3PPS1_LENGTH                              0x1
#define _RF3PPS_RF3PPS1_MASK                                0x2
#define _RF3PPS_RF3PPS2_POSN                                0x2
#define _RF3PPS_RF3PPS2_POSITION                            0x2
#define _RF3PPS_RF3PPS2_SIZE                                0x1
#define _RF3PPS_RF3PPS2_LENGTH                              0x1
#define _RF3PPS_RF3PPS2_MASK                                0x4
#define _RF3PPS_RF3PPS3_POSN                                0x3
#define _RF3PPS_RF3PPS3_POSITION                            0x3
#define _RF3PPS_RF3PPS3_SIZE                                0x1
#define _RF3PPS_RF3PPS3_LENGTH                              0x1
#define _RF3PPS_RF3PPS3_MASK                                0x8
#define _RF3PPS_RF3PPS4_POSN                                0x4
#define _RF3PPS_RF3PPS4_POSITION                            0x4
#define _RF3PPS_RF3PPS4_SIZE                                0x1
#define _RF3PPS_RF3PPS4_LENGTH                              0x1
#define _RF3PPS_RF3PPS4_MASK                                0x10
#define _RF3PPS_RF3PPS5_POSN                                0x5
#define _RF3PPS_RF3PPS5_POSITION                            0x5
#define _RF3PPS_RF3PPS5_SIZE                                0x1
#define _RF3PPS_RF3PPS5_LENGTH                              0x1
#define _RF3PPS_RF3PPS5_MASK                                0x20

// Register: RF4PPS
#define RF4PPS RF4PPS
extern volatile unsigned char           RF4PPS              __at(0x3A2C);
#ifndef _LIB_BUILD
asm("RF4PPS equ 03A2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF4PPS0                :1;
        unsigned RF4PPS1                :1;
        unsigned RF4PPS2                :1;
        unsigned RF4PPS3                :1;
        unsigned RF4PPS4                :1;
        unsigned RF4PPS5                :1;
    };
} RF4PPSbits_t;
extern volatile RF4PPSbits_t RF4PPSbits __at(0x3A2C);
// bitfield macros
#define _RF4PPS_RF4PPS0_POSN                                0x0
#define _RF4PPS_RF4PPS0_POSITION                            0x0
#define _RF4PPS_RF4PPS0_SIZE                                0x1
#define _RF4PPS_RF4PPS0_LENGTH                              0x1
#define _RF4PPS_RF4PPS0_MASK                                0x1
#define _RF4PPS_RF4PPS1_POSN                                0x1
#define _RF4PPS_RF4PPS1_POSITION                            0x1
#define _RF4PPS_RF4PPS1_SIZE                                0x1
#define _RF4PPS_RF4PPS1_LENGTH                              0x1
#define _RF4PPS_RF4PPS1_MASK                                0x2
#define _RF4PPS_RF4PPS2_POSN                                0x2
#define _RF4PPS_RF4PPS2_POSITION                            0x2
#define _RF4PPS_RF4PPS2_SIZE                                0x1
#define _RF4PPS_RF4PPS2_LENGTH                              0x1
#define _RF4PPS_RF4PPS2_MASK                                0x4
#define _RF4PPS_RF4PPS3_POSN                                0x3
#define _RF4PPS_RF4PPS3_POSITION                            0x3
#define _RF4PPS_RF4PPS3_SIZE                                0x1
#define _RF4PPS_RF4PPS3_LENGTH                              0x1
#define _RF4PPS_RF4PPS3_MASK                                0x8
#define _RF4PPS_RF4PPS4_POSN                                0x4
#define _RF4PPS_RF4PPS4_POSITION                            0x4
#define _RF4PPS_RF4PPS4_SIZE                                0x1
#define _RF4PPS_RF4PPS4_LENGTH                              0x1
#define _RF4PPS_RF4PPS4_MASK                                0x10
#define _RF4PPS_RF4PPS5_POSN                                0x5
#define _RF4PPS_RF4PPS5_POSITION                            0x5
#define _RF4PPS_RF4PPS5_SIZE                                0x1
#define _RF4PPS_RF4PPS5_LENGTH                              0x1
#define _RF4PPS_RF4PPS5_MASK                                0x20

