GopalSaraf/Practicals/PSDL/include/proc/pic18f56k42.h
// Register: CWG3DBR
#define CWG3DBR CWG3DBR
extern volatile unsigned char           CWG3DBR             __at(0x3F42);
#ifndef _LIB_BUILD
asm("CWG3DBR equ 03F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :8;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG3DBR                :8;
    };
    struct {
        unsigned CWG3DBR0               :1;
        unsigned CWG3DBR1               :1;
        unsigned CWG3DBR2               :1;
        unsigned CWG3DBR3               :1;
        unsigned CWG3DBR4               :1;
        unsigned CWG3DBR5               :1;
    };
} CWG3DBRbits_t;
extern volatile CWG3DBRbits_t CWG3DBRbits __at(0x3F42);
// bitfield macros
#define _CWG3DBR_DBR_POSN                                   0x0
#define _CWG3DBR_DBR_POSITION                               0x0
#define _CWG3DBR_DBR_SIZE                                   0x8
#define _CWG3DBR_DBR_LENGTH                                 0x8
#define _CWG3DBR_DBR_MASK                                   0xFF
#define _CWG3DBR_DBR0_POSN                                  0x0
#define _CWG3DBR_DBR0_POSITION                              0x0
#define _CWG3DBR_DBR0_SIZE                                  0x1
#define _CWG3DBR_DBR0_LENGTH                                0x1
#define _CWG3DBR_DBR0_MASK                                  0x1
#define _CWG3DBR_DBR1_POSN                                  0x1
#define _CWG3DBR_DBR1_POSITION                              0x1
#define _CWG3DBR_DBR1_SIZE                                  0x1
#define _CWG3DBR_DBR1_LENGTH                                0x1
#define _CWG3DBR_DBR1_MASK                                  0x2
#define _CWG3DBR_DBR2_POSN                                  0x2
#define _CWG3DBR_DBR2_POSITION                              0x2
#define _CWG3DBR_DBR2_SIZE                                  0x1
#define _CWG3DBR_DBR2_LENGTH                                0x1
#define _CWG3DBR_DBR2_MASK                                  0x4
#define _CWG3DBR_DBR3_POSN                                  0x3
#define _CWG3DBR_DBR3_POSITION                              0x3
#define _CWG3DBR_DBR3_SIZE                                  0x1
#define _CWG3DBR_DBR3_LENGTH                                0x1
#define _CWG3DBR_DBR3_MASK                                  0x8
#define _CWG3DBR_DBR4_POSN                                  0x4
#define _CWG3DBR_DBR4_POSITION                              0x4
#define _CWG3DBR_DBR4_SIZE                                  0x1
#define _CWG3DBR_DBR4_LENGTH                                0x1
#define _CWG3DBR_DBR4_MASK                                  0x10
#define _CWG3DBR_DBR5_POSN                                  0x5
#define _CWG3DBR_DBR5_POSITION                              0x5
#define _CWG3DBR_DBR5_SIZE                                  0x1
#define _CWG3DBR_DBR5_LENGTH                                0x1
#define _CWG3DBR_DBR5_MASK                                  0x20
#define _CWG3DBR_CWG3DBR_POSN                               0x0
#define _CWG3DBR_CWG3DBR_POSITION                           0x0
#define _CWG3DBR_CWG3DBR_SIZE                               0x8
#define _CWG3DBR_CWG3DBR_LENGTH                             0x8
#define _CWG3DBR_CWG3DBR_MASK                               0xFF
#define _CWG3DBR_CWG3DBR0_POSN                              0x0
#define _CWG3DBR_CWG3DBR0_POSITION                          0x0
#define _CWG3DBR_CWG3DBR0_SIZE                              0x1
#define _CWG3DBR_CWG3DBR0_LENGTH                            0x1
#define _CWG3DBR_CWG3DBR0_MASK                              0x1
#define _CWG3DBR_CWG3DBR1_POSN                              0x1
#define _CWG3DBR_CWG3DBR1_POSITION                          0x1
#define _CWG3DBR_CWG3DBR1_SIZE                              0x1
#define _CWG3DBR_CWG3DBR1_LENGTH                            0x1
#define _CWG3DBR_CWG3DBR1_MASK                              0x2
#define _CWG3DBR_CWG3DBR2_POSN                              0x2
#define _CWG3DBR_CWG3DBR2_POSITION                          0x2
#define _CWG3DBR_CWG3DBR2_SIZE                              0x1
#define _CWG3DBR_CWG3DBR2_LENGTH                            0x1
#define _CWG3DBR_CWG3DBR2_MASK                              0x4
#define _CWG3DBR_CWG3DBR3_POSN                              0x3
#define _CWG3DBR_CWG3DBR3_POSITION                          0x3
#define _CWG3DBR_CWG3DBR3_SIZE                              0x1
#define _CWG3DBR_CWG3DBR3_LENGTH                            0x1
#define _CWG3DBR_CWG3DBR3_MASK                              0x8
#define _CWG3DBR_CWG3DBR4_POSN                              0x4
#define _CWG3DBR_CWG3DBR4_POSITION                          0x4
#define _CWG3DBR_CWG3DBR4_SIZE                              0x1
#define _CWG3DBR_CWG3DBR4_LENGTH                            0x1
#define _CWG3DBR_CWG3DBR4_MASK                              0x10
#define _CWG3DBR_CWG3DBR5_POSN                              0x5
#define _CWG3DBR_CWG3DBR5_POSITION                          0x5
#define _CWG3DBR_CWG3DBR5_SIZE                              0x1
#define _CWG3DBR_CWG3DBR5_LENGTH                            0x1
#define _CWG3DBR_CWG3DBR5_MASK                              0x20

// Register: CWG3DBF
#define CWG3DBF CWG3DBF
extern volatile unsigned char           CWG3DBF             __at(0x3F43);
#ifndef _LIB_BUILD
asm("CWG3DBF equ 03F43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :8;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG3DBF                :8;
    };
    struct {
        unsigned CWG3DBF0               :1;
        unsigned CWG3DBF1               :1;
        unsigned CWG3DBF2               :1;
        unsigned CWG3DBF3               :1;
        unsigned CWG3DBF4               :1;
        unsigned CWG3DBF5               :1;
    };
} CWG3DBFbits_t;
extern volatile CWG3DBFbits_t CWG3DBFbits __at(0x3F43);
// bitfield macros
#define _CWG3DBF_DBF_POSN                                   0x0
#define _CWG3DBF_DBF_POSITION                               0x0
#define _CWG3DBF_DBF_SIZE                                   0x8
#define _CWG3DBF_DBF_LENGTH                                 0x8
#define _CWG3DBF_DBF_MASK                                   0xFF
#define _CWG3DBF_DBF0_POSN                                  0x0
#define _CWG3DBF_DBF0_POSITION                              0x0
#define _CWG3DBF_DBF0_SIZE                                  0x1
#define _CWG3DBF_DBF0_LENGTH                                0x1
#define _CWG3DBF_DBF0_MASK                                  0x1
#define _CWG3DBF_DBF1_POSN                                  0x1
#define _CWG3DBF_DBF1_POSITION                              0x1
#define _CWG3DBF_DBF1_SIZE                                  0x1
#define _CWG3DBF_DBF1_LENGTH                                0x1
#define _CWG3DBF_DBF1_MASK                                  0x2
#define _CWG3DBF_DBF2_POSN                                  0x2
#define _CWG3DBF_DBF2_POSITION                              0x2
#define _CWG3DBF_DBF2_SIZE                                  0x1
#define _CWG3DBF_DBF2_LENGTH                                0x1
#define _CWG3DBF_DBF2_MASK                                  0x4
#define _CWG3DBF_DBF3_POSN                                  0x3
#define _CWG3DBF_DBF3_POSITION                              0x3
#define _CWG3DBF_DBF3_SIZE                                  0x1
#define _CWG3DBF_DBF3_LENGTH                                0x1
#define _CWG3DBF_DBF3_MASK                                  0x8
#define _CWG3DBF_DBF4_POSN                                  0x4
#define _CWG3DBF_DBF4_POSITION                              0x4
#define _CWG3DBF_DBF4_SIZE                                  0x1
#define _CWG3DBF_DBF4_LENGTH                                0x1
#define _CWG3DBF_DBF4_MASK                                  0x10
#define _CWG3DBF_DBF5_POSN                                  0x5
#define _CWG3DBF_DBF5_POSITION                              0x5
#define _CWG3DBF_DBF5_SIZE                                  0x1
#define _CWG3DBF_DBF5_LENGTH                                0x1
#define _CWG3DBF_DBF5_MASK                                  0x20
#define _CWG3DBF_CWG3DBF_POSN                               0x0
#define _CWG3DBF_CWG3DBF_POSITION                           0x0
#define _CWG3DBF_CWG3DBF_SIZE                               0x8
#define _CWG3DBF_CWG3DBF_LENGTH                             0x8
#define _CWG3DBF_CWG3DBF_MASK                               0xFF
#define _CWG3DBF_CWG3DBF0_POSN                              0x0
#define _CWG3DBF_CWG3DBF0_POSITION                          0x0
#define _CWG3DBF_CWG3DBF0_SIZE                              0x1
#define _CWG3DBF_CWG3DBF0_LENGTH                            0x1
#define _CWG3DBF_CWG3DBF0_MASK                              0x1
#define _CWG3DBF_CWG3DBF1_POSN                              0x1
#define _CWG3DBF_CWG3DBF1_POSITION                          0x1
#define _CWG3DBF_CWG3DBF1_SIZE                              0x1
#define _CWG3DBF_CWG3DBF1_LENGTH                            0x1
#define _CWG3DBF_CWG3DBF1_MASK                              0x2
#define _CWG3DBF_CWG3DBF2_POSN                              0x2
#define _CWG3DBF_CWG3DBF2_POSITION                          0x2
#define _CWG3DBF_CWG3DBF2_SIZE                              0x1
#define _CWG3DBF_CWG3DBF2_LENGTH                            0x1
#define _CWG3DBF_CWG3DBF2_MASK                              0x4
#define _CWG3DBF_CWG3DBF3_POSN                              0x3
#define _CWG3DBF_CWG3DBF3_POSITION                          0x3
#define _CWG3DBF_CWG3DBF3_SIZE                              0x1
#define _CWG3DBF_CWG3DBF3_LENGTH                            0x1
#define _CWG3DBF_CWG3DBF3_MASK                              0x8
#define _CWG3DBF_CWG3DBF4_POSN                              0x4
#define _CWG3DBF_CWG3DBF4_POSITION                          0x4
#define _CWG3DBF_CWG3DBF4_SIZE                              0x1
#define _CWG3DBF_CWG3DBF4_LENGTH                            0x1
#define _CWG3DBF_CWG3DBF4_MASK                              0x10
#define _CWG3DBF_CWG3DBF5_POSN                              0x5
#define _CWG3DBF_CWG3DBF5_POSITION                          0x5
#define _CWG3DBF_CWG3DBF5_SIZE                              0x1
#define _CWG3DBF_CWG3DBF5_LENGTH                            0x1
#define _CWG3DBF_CWG3DBF5_MASK                              0x20

